{
  "ir_version": "0.1.0",
  "schema_id": "https://github.com/egallmann/ste-spec/contracts/architecture-ir/architecture-ir.schema.json",
  "document_id": "sha256:0123456789abcdef0123456789abcdef0123456789abcdef0123456789abcdef",
  "assembled_at": "2026-03-20T12:00:00.000Z",
  "namespace": "repo:example-system",
  "entities": {
    "capabilities": [],
    "decisions": [],
    "components": [],
    "invariants": [],
    "rules": [],
    "evidences": []
  },
  "relationships": {
    "decision_supports_capability": [],
    "component_implements_decision": [],
    "invariant_constrains_component": [],
    "rule_evaluates_decision": [],
    "evidence_supports_component": []
  },
  "extensions": {}
}
